# Multi-table Datasets - ENRON Archive

## 1. Data import

Connect to the file 'assets/datasets/enron.db' using one of these methods:

- sqlite3 python package
- pandas.read_sql
- SQLite Manager Firefox extension

Take a look at the database and query the master table. How many Tables are there in the db?

> Answer:
There are 3 tables:
- MessageBase
- RecipientBase
- EmployeeBase

In [120]:
import sqlite3
conn = sqlite3.connect('../../assets/datasets/enron.db')
c = conn.cursor()
conn.commit()
c.execute("SELECT name FROM sqlite_master WHERE type = 'table'").fetchall()

[(u'MessageBase',), (u'RecipientBase',), (u'EmployeeBase',)]

Query the `sqlite_master` table to retrieve the schema of the `EmployeeBase` table.

1. What fields are there?
1. What's the type of each of them?

In [121]:
# fetch = c.execute("SELECT * from sqlite_master;").fetchall()
# for row in fetch:
#     print row
#     print

In [122]:
fields = c.execute("SELECT sql from sqlite_master WHERE type ='table' and name='EmployeeBase';").fetchall()
print "".join(fields[0])

fields = c.execute("SELECT sql from sqlite_master WHERE type ='table' and name='MessageBase';").fetchall()
#print ''.join(fields[0])

fields = c.execute("SELECT sql from sqlite_master WHERE type ='table' and name='RecipientBase';").fetchall()
#print ''.join(fields[0])

#[12:02]

CREATE TABLE EmployeeBase (
                  [eid] INTEGER,
  [name] TEXT,
  [department] TEXT,
  [longdepartment] TEXT,
  [title] TEXT,
  [gender] TEXT,
  [seniority] TEXT

                  )

In [123]:
#import pandas as pd
import pandas as pd
from pandas.io import sql
sql.read_sql("SELECT * FROM EmployeeBase LIMIT 5",con =conn)

,eid,name,department,longdepartment,title,gender,seniority
0,1,John Arnold,Forestry,ENA Gas Financial,VP Trading,Male,Senior
1,2,Harry Arora,Forestry,ENA East Power,VP Trading,Male,Senior
2,3,Robert Badeer,Forestry,ENA West Power,Mgr Trading,Male,Junior
3,4,Susan Bailey,Legal,ENA Legal,Specialist Legal,Female,Junior
4,5,Eric Bass,Forestry,ENA Gas Texas,Trader,Male,Junior

In [124]:
fields =c.execute("select sql from sqlite_master where type = 'table' and name = 'EmployeeBase';").fetchall()
print("".join(fields[0]))
#print ''.join(fields[0])

CREATE TABLE EmployeeBase (
                  [eid] INTEGER,
  [name] TEXT,
  [department] TEXT,
  [longdepartment] TEXT,
  [title] TEXT,
  [gender] TEXT,
  [seniority] TEXT

                  )

1. Print the first 5 rows of EmployeeBase table
1. Print the first 5 rows of MessageBase table
1. Print the first 5 rows of RecipientBase table

**Hint**  use `SELECT` and `LIMIT`.

In [125]:
res = c.execute("select * from EmployeeBase limit 5;").fetchall()
for row in res:
    print(row)

(1, u'John Arnold', u'Forestry', u'ENA Gas Financial', u'VP Trading', u'Male', u'Senior')
(2, u'Harry Arora', u'Forestry', u'ENA East Power', u'VP Trading', u'Male', u'Senior')
(3, u'Robert Badeer', u'Forestry', u'ENA West Power', u'Mgr Trading', u'Male', u'Junior')
(4, u'Susan Bailey', u'Legal', u'ENA Legal', u'Specialist Legal', u'Female', u'Junior')
(5, u'Eric Bass', u'Forestry', u'ENA Gas Texas', u'Trader', u'Male', u'Junior')

In [126]:
res1 = c.execute("select * from MessageBase limit 5;").fetchall()
for row in res1:
    print(row)

(1, u'taylor-m/sent/11', 910930020, u'Cd$ CME letter', 138)
(2, u'taylor-m/sent/17', 911459940, u'Indemnification', 138)
(3, u'taylor-m/sent/18', 911463840, u'Re: Indemnification', 138)
(4, u'taylor-m/sent/23', 911874180, u'Re: Coral Energy, L.P.', 138)
(5, u'taylor-m/sent/27', 912396120, u'Bankruptcy Code revisions', 138)

In [127]:
res2 = c.execute("select * from RecipientBase limit 5;").fetchall()
for row in res2:
    print(row)

(1, 1, 59)
(2, 1, 15)
(3, 1, 15)
(4, 1, 109)
(4, 2, 49)

In [128]:
sql.read_sql("select * from EmployeeBase limit 5",con = conn)

,eid,name,department,longdepartment,title,gender,seniority
0,1,John Arnold,Forestry,ENA Gas Financial,VP Trading,Male,Senior
1,2,Harry Arora,Forestry,ENA East Power,VP Trading,Male,Senior
2,3,Robert Badeer,Forestry,ENA West Power,Mgr Trading,Male,Junior
3,4,Susan Bailey,Legal,ENA Legal,Specialist Legal,Female,Junior
4,5,Eric Bass,Forestry,ENA Gas Texas,Trader,Male,Junior

In [129]:
sql.read_sql("select * from MessageBase limit 5",con = conn)

   mid          filename  unix_time                    subject  from_eid
0    1  taylor-m/sent/11  910930020             Cd$ CME letter       138
1    2  taylor-m/sent/17  911459940            Indemnification       138
2    3  taylor-m/sent/18  911463840        Re: Indemnification       138
3    4  taylor-m/sent/23  911874180     Re: Coral Energy, L.P.       138
4    5  taylor-m/sent/27  912396120  Bankruptcy Code revisions       138

In [130]:
sql.read_sql("select * from RecipientBase limit 5",con = conn)

   mid  rno  to_eid
0    1    1      59
1    2    1      15
2    3    1      15
3    4    1     109
4    4    2      49

Import each of the 3 tables to a Pandas Dataframes

In [131]:
employee = pd.read_sql('select * from EmployeeBase;',conn)
employee.head(5)

,eid,name,department,longdepartment,title,gender,seniority
0,1,John Arnold,Forestry,ENA Gas Financial,VP Trading,Male,Senior
1,2,Harry Arora,Forestry,ENA East Power,VP Trading,Male,Senior
2,3,Robert Badeer,Forestry,ENA West Power,Mgr Trading,Male,Junior
3,4,Susan Bailey,Legal,ENA Legal,Specialist Legal,Female,Junior
4,5,Eric Bass,Forestry,ENA Gas Texas,Trader,Male,Junior

In [132]:
Recipients = pd.read_sql('select * from RecipientBase;',conn)
Recipients.head(5)

   mid  rno  to_eid
0    1    1      59
1    2    1      15
2    3    1      15
3    4    1     109
4    4    2      49

In [273]:
Message = pd.read_sql('select * from MessageBase ;',conn)
Message.head(5)

   mid          filename  unix_time                    subject  from_eid
0    1  taylor-m/sent/11  910930020             Cd$ CME letter       138
1    2  taylor-m/sent/17  911459940            Indemnification       138
2    3  taylor-m/sent/18  911463840        Re: Indemnification       138
3    4  taylor-m/sent/23  911874180     Re: Coral Energy, L.P.       138
4    5  taylor-m/sent/27  912396120  Bankruptcy Code revisions       138

## 3. Data Merging

Use the pandas merge function to combine the information in the 3 dataframes to answer the following questions:

1. Are there more Men or Women employees?
- How is gender distributed across departments?
- Who is sending more emails? Men or Women?
- What's the average number of emails sent by each gender?
- Are there more Juniors or Seniors?
- Who is sending more emails? Juniors or Seniors?
- Which department is sending more emails? How does that relate with the number of employees in the department?
- Who are the top 3 senders of emails? (people who sent out the most emails)

In [280]:
#8
sql.read_sql("select from_eid,count(mid) from MessageBase group by from_eid order by count(mid) desc",conn)

     from_eid  count(mid)
0          20        1597
1          59        1379
2         120        1142
3         131         859
4         138         658
5         130         654
6          39         443
7         145         409
8          91         403
9          95         395
10         34         366
11         65         361
12         61         354
13         67         354
14          1         341
15         48         322
16        117         322
17          5         318
18         46         318
19         43         316
20        151         302
21        122         295
22         24         290
23         92         273
24         74         260
25         69         249
26        137         244
27        144         237
28        149         227
29        118         224
..        ...         ...
122        55          12
123        14          10
124        22          10
125        35          10
126       124          10
127       128          10
128       136          10
129       141          10
130        12           9
131        13           9
132        64           9
133        96           9
134        50           8
135       110           8
136       132           8
137        16           7
138        28           7
139        71           7
140       103           7
141        83           6
142        89           6
143        97           6
144        23           5
145       105           5
146       150           5
147        70           4
148        99           3
149         8           2
150        21           1
151        86           1

[152 rows x 2 columns]

In [253]:
a= sql.read_sql('''select e.gender, count(m.from_eid)  
from EmployeeBase as e 
join Message as m 
on e.eid == m.from_eid   
group by gender''', conn)
a# 3

  e.gender  count(m.from_eid)
0   Female               8794
1     Male              12841

In [254]:
#5
employee["seniority"].value_counts()

Junior    82
Senior    74
Name: seniority, dtype: int64

In [257]:
#6
sql.read_sql('''select e.seniority, count(m.from_eid)  
from EmployeeBase as e 
join Message as m 
on e.eid == m.from_eid   
group by seniority ''', conn)

  e.seniority  count(m.from_eid)
0      Junior               9196
1      Senior              12439

In [262]:
#7
sql.read_sql('''select e.department, count(e.eid)  
from EmployeeBase as e 
join Message as m 
on e.eid == m.from_eid   
group by  department''', conn)

  e.department  count(e.eid)
0     Forestry          4387
1        Legal         10396
2        Other          6852

In [279]:
#8
sql.read_sql('''select e.eid, count(m.mid)  
from EmployeeBase as e 
join Message as m 
on e.eid == m.from_eid group by m.from_eid  
order by count(m.mid)  desc''' , conn)

     e.eid  count(m.mid)
0       20          1597
1       59          1379
2      120          1142
3      131           859
4      138           658
5      130           654
6       39           443
7      145           409
8       91           403
9       95           395
10      34           366
11      65           361
12      61           354
13      67           354
14       1           341
15      48           322
16     117           322
17       5           318
18      46           318
19      43           316
20     151           302
21     122           295
22      24           290
23      92           273
24      74           260
25      69           249
26     137           244
27     144           237
28     149           227
29     118           224
..     ...           ...
122     55            12
123     14            10
124     22            10
125     35            10
126    124            10
127    128            10
128    136            10
129    141            10
130     12             9
131     13             9
132     64             9
133     96             9
134     50             8
135    110             8
136    132             8
137     16             7
138     28             7
139     71             7
140    103             7
141     83             6
142     89             6
143     97             6
144     23             5
145    105             5
146    150             5
147     70             4
148     99             3
149      8             2
150     21             1
151     86             1

[152 rows x 2 columns]

In [258]:
a["e.gender"].value_counts()/employee["gender"].value_counts()

Male      0.008850
Female    0.023256
dtype: float64

In [204]:
employee["gender"].value_counts() # more men

Male      113
Female     43
Name: gender, dtype: int64

In [222]:
employee["gender"].count()

156

In [223]:
employee["gender"].value_counts()/employee["gender"].count()

Male      0.724359
Female    0.275641
Name: gender, dtype: float64

In [225]:
employee.groupby("department")["gender"].value_counts()/employee.groupby("department")["gender"].count()

department  gender
Forestry    Male      0.833333
            Female    0.166667
Legal       Female    0.520000
            Male      0.480000
Other       Male      0.718310
            Female    0.281690
Name: gender, dtype: float64

In [235]:
df = pd.merge(employee, Message, left_on='eid', right_on='from_eid')
df.gender.value_counts() / df.gender.count()

Male      0.593529
Female    0.406471
Name: gender, dtype: float64

In [236]:
df = pd.merge(employee, Message, left_on='eid', right_on='from_eid')
df.gender.value_counts()/df.gender.count()

Male      0.593529
Female    0.406471
Name: gender, dtype: float64

In [240]:
sql.read_sql("select e.gender, count(e.eid) 
             from EmployeeBase as e join Message as m on e.eid == m.from_eid  
             group by gender;", conn) # male

SyntaxError: EOL while scanning string literal (<ipython-input-240-989e6e895fff>, line 1)

## 2. Data Exploration

Use the 3 dataframes to answer the following questions:

1. How many employees are there in the company?
- How many messages are there in the database?
- Convert the timestamp column in the messages. When was the oldest message sent? And the newest?
- Some messages are sent to more than one recipient. Group the messages by message_id and count the number of recepients. Then look at the distribution of recepient numbers.
    - How many messages have only one recepient?
    - How many messages have >= 5 recepients?
    - What's the highest number of recepients?
    - Who sent the message with the highest number of recepients?
- Plot the distribution of recepient numbers using Bokeh.

In [134]:
sql.read_sql("select count(eid) from employee", conn)

   count(eid)
0         156

In [135]:
sql.read_sql("select count(mid) from Message", conn)

   count(mid)
0       21635

In [203]:
sql.read_sql("select * from MessageBase where mid in(12116,12151)", conn)

     mid                      filename  unix_time subject  from_eid
0  12116  baughman-d/all_documents/398  990510780                67
1  12151       baughman-d/ect_admin/22  990546780                67

In [201]:
c = sql.read_sql(" select mid,count(to_eid) from RecipientBase group by mid order by 2 desc ",conn)
#c["count(to_eid)"].max()
c

         mid  count(to_eid)
0      12116             57
1      12151             57
2      12140             55
3      14404             52
4      16035             49
5      16431             24
6       8116             22
7      15148             21
8      15577             21
9      21103             20
10     21047             19
11     19671             18
12      6495             17
13     10087             17
14     11492             16
15     11516             16
16     12584             16
17     14194             16
18     14457             16
19     14547             16
20     18305             16
21     19028             16
22     21628             16
23      1355             15
24      5664             15
25      8945             15
26      8970             15
27      9154             15
28      9341             15
29     10624             15
...      ...            ...
21605  21599              1
21606  21600              1
21607  21601              1
21608  21602              1
21609  21603              1
21610  21604              1
21611  21605              1
21612  21606              1
21613  21607              1
21614  21608              1
21615  21609              1
21616  21610              1
21617  21611              1
21618  21612              1
21619  21613              1
21620  21614              1
21621  21615              1
21622  21616              1
21623  21617              1
21624  21618              1
21625  21619              1
21626  21620              1
21627  21621              1
21628  21622              1
21629  21627              1
21630  21629              1
21631  21630              1
21632  21631              1
21633  21632              1
21634  21633              1

[21635 rows x 2 columns]

In [189]:
#c = sql.read_sql(" select mid,count(to_eid) from RecipientBase group by mid order by 2 desc ",conn)

In [195]:
#sql.read_sql(" select mid,count(to_eid) from RecipientBase group by mid order by 2 desc ",conn)

         mid  count(to_eid)
0      12116             57
1      12151             57
2      12140             55
3      14404             52
4      16035             49
5      16431             24
6       8116             22
7      15148             21
8      15577             21
9      21103             20
10     21047             19
11     19671             18
12      6495             17
13     10087             17
14     11492             16
15     11516             16
16     12584             16
17     14194             16
18     14457             16
19     14547             16
20     18305             16
21     19028             16
22     21628             16
23      1355             15
24      5664             15
25      8945             15
26      8970             15
27      9154             15
28      9341             15
29     10624             15
...      ...            ...
21605  21599              1
21606  21600              1
21607  21601              1
21608  21602              1
21609  21603              1
21610  21604              1
21611  21605              1
21612  21606              1
21613  21607              1
21614  21608              1
21615  21609              1
21616  21610              1
21617  21611              1
21618  21612              1
21619  21613              1
21620  21614              1
21621  21615              1
21622  21616              1
21623  21617              1
21624  21618              1
21625  21619              1
21626  21620              1
21627  21621              1
21628  21622              1
21629  21627              1
21630  21629              1
21631  21630              1
21632  21631              1
21633  21632              1
21634  21633              1

[21635 rows x 2 columns]

In [194]:
#sql.read_sql(" select mid,count(to_eid) from RecipientBase group by mid having count(to_eid) >5 ",conn)

In [196]:
c["count(to_eid)"].value_counts()

1     14985
2      2962
3      1435
4       873
5       711
6       180
7       176
8        61
13       57
11       47
12       33
10       29
15       28
9        24
14       11
16        9
21        2
17        2
57        2
22        1
52        1
20        1
55        1
19        1
24        1
18        1
49        1
Name: count(to_eid), dtype: int64

In [154]:
sql.read_sql("select mid,max(to_eid) from RecipientBase",conn)

   mid  max(to_eid)
0  900          156

In [158]:
sql.read_sql("select mid, max(from_eid) from MessageBase",conn)

   mid  max(from_eid)
0  928            156

Rescale to investigate the tail of the curve

In [ ]:
employe

Answer the following questions regarding received messages:

- Who is receiving more emails? Men or Women?
- Who is receiving more emails? Juniors or Seniors?
- Which department is receiving more emails? How does that relate with the number of employees in the department?
- Who are the top 5 receivers of emails? (people who received the most emails)

Which employees sent the most 'mass' emails?

Keep exploring the dataset, which other questions would you ask?

Work in pairs. Give each other a challenge and try to solve it.